In [1]:
#Agenda
#What is a DataFrame?
#Create a DataFrame from clipboard
#Display column names
#Access one or more columns
#What is NAN value
#Create a column with NAN values
#Head and Tail functions
#Assign values to a dataframe using 1. Numpy 2. Series
#Delete a column
#Convert dictionary to a dataframe
#Summarize

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# What is a DataFrame?
##### 2-Dimensional with 3 principal components =>Rows, Columns and Values
##### Similar to a table in excel sheet
##### Labelled axes- Rows and Columns are labelled
##### Size mutable- size of a dataframe can be changed anytime

In [3]:
#Create a DataFrame from clipboard
#Data link: https://en.wikipedia.org/wiki/Table_(information)#:~:text=A%20table%20is%20an%20arrangement,signs%2C%20and%20many%20other%20places.
age_df= pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [4]:
#Display column names
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [5]:
#Access one or more columns
age_df["First name"]

0         Tinu
1        Marek
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [6]:
age_df[["First name", "Age"]]

  First name  Age
0       Tinu   14
1      Marek   25
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8   Kgaogelo   11

In [7]:
#What is NAN value?
#   Null value

#Create a column with NAN values
age_df["rank"]= np.nan
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22   NaN
6  Jon-Kabat         Zinn   22   NaN
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [8]:
#Head and Tail functions
age_df.head()

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN

In [9]:
age_df.tail()

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [10]:
#Assign values to a dataframe using...

#1. Numpy

array_1= np.arange(9)
print(array_1)

[0 1 2 3 4 5 6 7 8]

In [11]:
age_df["rank"]= array_1
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14     0
1      Marek  Kostrzewski   25     1
2       Lily    McGarrett   18     2
3  Olatunkbo     Chijiaku   22     3
4   Adrienne     Anthoula   22     4
5     Axelia   Athanasios   22     5
6  Jon-Kabat         Zinn   22     6
7    Thabang        Mosoa   15     7
8   Kgaogelo        Mosoa   11     8

In [12]:
#2.Series

newrank_series= Series([10,11,12], index= [3,5,6])
age_df["rank"]= newrank_series
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22  10.0
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22  11.0
6  Jon-Kabat         Zinn   22  12.0
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [13]:
#Delete a column
del(age_df["Last name"])
print(age_df)

  First name  Age  rank
0       Tinu   14   NaN
1      Marek   25   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8   Kgaogelo   11   NaN

In [14]:
#Convert dictionary to a dataframe
sample_dict= {
    'company': ["Nestle", "PG"], 
    'profit': [1000, 500]
}

print(sample_dict)

{'company': ['Nestle', 'PG'], 'profit': [1000, 500]}

In [15]:
sample_df= DataFrame(sample_dict)

In [16]:
print(sample_df)

  company  profit
0  Nestle    1000
1      PG     500